define ['../products.module'], (product) ->
	'use strict'
	product.controller 'ProductTechsHybridVideoRecordersController', [
		'$scope'
		($scope) ->
			unless $scope.product.techs then $scope.product.techs = [
				['Артикул', '']
				['Тип', '']
				['Операционная система', '']
				['Формат сжатия видео', '']
				['Режим работы', '']
				['Максимальное количество аналоговых каналов', '']
				['Максимальное количество IP каналов', '']
				['Максимальная скорость записи', '']
				['Количество HDD', '']
				['Отображение видео', '']
				['Облачные технологии', '']
				['Видеоаналитика', '']
				['Onvif', '']
				['Входы', '']
				['Выходы', '']
				['Поддержка WiFi, 3G', '']
				['Количество USB портов', '']
				['Порты RJ-45, RS232, RS-485', '']
				['Цвет', '']
				['Вес', '']
				['Габариты', '']
				['Страна производитель', '']
				['Питание и потребление', '']
			]
	]